[
    {
        "id": 0,
        "dialogue": "Change your selection using the arrow keys. When you're done reading text, press enter. Use the arrow keys to move. Interact with objects by pressing Enter. When you're done collecting clues, press D.",
        "entry": true,
        "text_only": true,
        "trigger": 1,
        "load_scene": "crime-scene"
    },
    {
        "id": 1,
        "dialogue": "Last night, your squad was invited to the Japanese Foreign Ambassador's party to celebrate his return from Manchuria, but you unfortunately couldn't go due to prior plans with the Navy Lieutenant. Although up early like any other work day, today you were excused from the morning shift because of your plans with the Lieutenant. You prepare for work none the less, and leave in the afternoon after the maid finished packing your lunch.",
        "text_only": true,
        "trigger": 2
    },
    {
        "id": 2,
        "dialogue": "You get a call from the boss to go to the scene.",
        "text_only": true,
        "trigger": 3
    },
    {
        "id": 3,
        "dialogue": "An uneventful day at the office, it seemed. However, your partner was missing from his usual post next to your personal office space. Suddenly, you get a call from your squad leader to come to the Foreign Ambassador's home because he was found dead this morning.",
        "text_only": true,
        "trigger": 4
    },
    {
        "id": 4,
        "dialogue": "You go to the scene; your partner is already there.",
        "text_only": false,
        "trigger": 5
    },
    {
        "id": 5,
        "dialogue": "",
        "character_id": 1,
        "movements": [
            [620, 940]
        ],
        "text_only": false,
        "trigger": 6
    },
    {
        "id": 6,
        "dialogue": "Upon arriving there, you're greeted by Rei, your partner.",
        "text_only": false,
        "trigger": 7
    },
    {
        "id": 7,
        "dialogue": "You talk to your partner and he debriefs you on the general details about the guy and his death.",
        "text_only": false,
        "trigger": 8
    },
    {
        "id": 8,
        "dialogue": "Rei: Good morning Sades, or maybe not... Not really what we expected when we woke up today, huh? The Ambassador has been found dead by his Mistress this morning.  I can't believe I shook his hand just last night... It looks like he was poisoned at some point, and I'm operating under the assumption that it was for political reasons. Go ahead and take a look around, I'll come up with some initial hypotheses and suspects while you do that.",
        "text_only": false,
        "trigger": 9
    },
    {
        "id": 9,
        "dialogue": "",
        "character_id": 2,
        "movements": [
            [620, 380],
            [840, 380],
            [840, 320],
            [1260, 320],
            [1260, 190],
            [1260, 200]
        ],
        "text_only": false,
        "trigger": 10
    },
    {
        "id": 10,
        "dialogue": "As Detective Sades, you will be able to move around and try and collect as many clues per level as you possibly can.   All levels are structured similarly to the Intro level, but be wary, not everything is as it seems.",
        "text_only": false,
        "trigger": 11
    },
    {
        "id": 11,
        "dialogue": "Investigate Crime Scene, 4 clues to collect.",
        "text_only": false
    },
    {
        "id": 12,
        "dialogue": "The Ambassador as you know, was a key figure in the recent victory in Manchuria and continued control of Korea. However, he was also the one responsible for stopping further invasions and had connections to the Chinese governments. Too controlled for his own good, you know he was a target of all the parties he worked with.",
        "text_only": true,
        "trigger": 18
    },
    {
        "id": 13,
        "dialogue": "Are you sure you're done collecting clues?",
        "trigger_on_done": true,
        "options": [
            {
                "text": "Yes",
                "trigger": 12
            },
            {
                "text": "No",
                "trigger": -1
            }
        ],
        "scene": "crime-scene",
        "text_only": true
    },
    {
        "id": 14,
        "dialogue": "The Ambassador's body looks sickly, but no signs of any real struggle or wounds indicating outside physical harm.  Maybe a poison was used?",
        "clue": [161, 341, 51, 35],
        "clue_id": 1,
        "text_only": false
    },
    {
        "id": 15,
        "dialogue": "The maid seems crestfallen, and she says that during the party, she overheard some chatter about drinks that seemed unnatural, but she didn't think much of it.",
        "clue": [963, 134, 32, 48],
        "clue_id": 2,
        "text_only": false
    },
    {
        "id": 16,
        "dialogue": "The lock was broken off and hidden in haste, indicating the sloppy, headstrong nature that the murderer may apply in his/her daily life.",
        "clue": [398, 130, 38, 49],
        "clue_id": 3,
        "text_only": false
    },
    {
        "id": 17,
        "dialogue": "The assistant was void of emotion, either from shock or another reason.  She was in charge of everything, and you learn more about the guests invited, namely some of the naval officials, as well as some others.",
        "clue": [1063, 952, 32, 48],
        "clue_id": 4,
        "text_only": false
    },
    {
        "id": 18,
        "dialogue": "Rei: Here the suspicious individuals we have identified so far.",
        "trigger": 19,
        "text_only": true
    },
    {
        "id": 19,
        "dialogue": "Hashida Makoto: Foolish would be a fitting word to describe Hashida, a man who obeys his orders but is excessively aggressive and nationalistic. He doesn’t like the Chinese and the Koreans and believes in the Japanese government’s fairness and rights.",
        "text_only": true,
        "trigger": 20
    },
    {
        "id": 20,
        "dialogue": "Jeremy Pike: The American ambassador, who has military experience, is extremely hard to figure out.  He doesn't seem to think highly of the emperor, and is just in Japan to maintain relations.",
        "text_only": true,
        "trigger": 21
    },
    {
        "id": 21,
        "dialogue": "Yuki Kumamoto: An old, graceful woman, who exudes confidence and poise.  She owns an inn that she runs most of the day.  Originally of Chinese descent, she was adopted by her late husband's father for political status but hasn't been an active Japanese national in the nation's politics.",
        "text_only": true,
        "trigger": 22
    },
    {
        "id": 22,
        "dialogue": "You to Rei: Have you identified the poison that was found on the body?",
        "text_only": true,
        "trigger": 23
    },
    {
        "id": 23,
        "dialogue": "Rei: Yes, it was a slow acting one and seems to be fresh. I believe it could have been applied between 14-16 hours ago, during the beginning of the party.",
        "text_only": true,
        "trigger": 24
    },
    {
        "id": 24,
        "dialogue": "You to Rei: Which one of the suspects do you think it is?",
        "text_only": true,
        "trigger": 25
    },
    {
        "id": 25,
        "dialogue": "Rei: It could be all of them, but I personally believe that the American Ambassador was responsible because America doesn't like the Empire expanding to towards the West.",
        "text_only": true,
        "trigger": 26 
    },
    {
        "id": 26,
        "dialogue": "You to Rei: It seems that whoever did it left the party normally like everyone else.",
        "text_only": true,
        "trigger": 27,
        "clues_necessary": [2, 3]
    },
    {
        "id": 27,
        "dialogue": "Rei: They must be an important and intelligent person.",
        "text_only": true,
        "trigger": 28,
        "clues_necessary": [2, 3]
    },
    {
        "id": 28,
        "dialogue": "You to the guard who oversaw the house: Can you tell me who came in before 4 P.M to the party?",
        "text_only": true,
        "trigger": 29,
        "clues_necessary": [1, 3, 4]
    },
    {
        "id": 29,
        "dialogue": "Guard: Investigator Rei, Rei's wife, Hashida, and Yuki",
        "text_only": true,
        "trigger": 30,
        "clues_necessary": [1, 3, 4]
    },
    {
        "id": 30,
        "dialogue": "Choose to investigate one of the suspects",
        "text_only": true,
        "options": [
            {
                "text": "Hashida Makoto",
                "trigger": 31
            },
            {
                "text": "Jeremy Pike",
                "trigger": 32
            },
            {
                "text": "Yuki Kumamoto",
                "trigger": 33
            },
            {
                "text": "Done investigating.",
                "trigger": 1000
            }
        ]
    },
    {
        "id": 31,
        "dialogue": "Rei: Let's see the matter through.",
        "text_only": true,
        "load_scene": "apartment",
        "trigger": 34
    },
    {
        "id": 32,
        "dialogue": "Rei: Let's see the matter through.",
        "text_only": true,
        "load_scene": "embassy",
        "trigger": 34
    },
    {
        "id": 33,
        "dialogue": "Rei: Let's see the matter through.",
        "text_only": true,
        "load_scene": "inn",
        "trigger": 79
    },
    {
        "id": 34,
        "dialogue": "You think of the reasons that Americans would want to stop the great country of Japan for.",
        "text_only": true,
        "trigger": 35
    },
    {
        "id": 35,
        "dialogue": "You: Ambassador Pike may be a little racist, and the world just seems tense at the moment.  Maybe he was ordered by his superiors to do something?",
        "text_only": true,
        "trigger": 36
    },
    {
        "id": 35,
        "dialogue": "You decide to investigate further by visiting him in the embassy.",
        "text_only": true,
        "trigger": 36
    },
    {
        "id": 36,
        "dialogue": "Regardless, you make your way to the United States Embassy in search of potential answers.",
        "text_only": true,
        "trigger": 37
    },
    {
        "id": 37,
        "dialogue": "You get asked why you're visiting the embassy.",
        "text_only": true,
        "trigger": 38
    },
    {
        "id": 38,
        "dialogue": "Front Desk Person: May I ask what your purpose is for visiting the United States Embassy?",
        "text_only": true,
        "options": [
            {
                "text": "Tell her that Jeremy is a suspect.",
                "trigger": 39
            },
            {
                "text": "Don't tell her that Jeremy is a suspect.",
                "trigger": 45
            }
        ]
    },
    {
        "id": 39,
        "dialogue": "You: My division and I have identified him as a potential suspect of the murder of the Japanese Ambassador. Could I ask a few questions to him?",
        "text_only": true,
        "trigger": 40
    },
    {
        "id": 40,
        "dialogue": "Front Desk Person immediately contacts Ambassador Pike.",
        "text_only": true,
        "trigger": 41
    },
    {
        "id": 41,
        "dialogue": "Front Desk Person: Yes. Please wait while I ask for him. She gets up, goes straight ahead, and takes a right.  10 seconds later, 20 American soldiers with guns storm out with the Front Desk Person behind them.",
        "text_only": true,
        "trigger": 42
    },
    {
        "id": 42,
        "dialogue": "You are told to leave the embassy.",
        "text_only": true,
        "trigger": 43
    },
    {
        "id": 43,
        "dialogue": "One of the soldiers: It appears that the Ambassador does not wish to speak to you. We will escort you out of the premises.",
        "text_only": true,
        "trigger": 44
    },
    {
        "id": 44,
        "dialogue": "Seeing the American soldiers waiting to escort you, you realize that you can't cause any more trouble. So, you leave the embassy and head back to the office.",
        "text_only": true,
        "trigger": 30
    },
    {
        "id": 45,
        "dialogue": "You: I'm just questioning all of the people who were at the Japanese Ambassador's party, and coming up with some initial conclusions. Could I speak to him?",
        "text_only": true,
        "trigger": 46
    },
    {
        "id": 46,
        "dialogue": "You are told to wait, he is currently in a meeting, you decide this might be a good time to investigate his office.",
        "text_only": true,
        "trigger": 47
    },
    {
        "id": 47,
        "dialogue": "Front Desk Person: He's currently in a meeting, but if you could wait, he will be out in a bit.",
        "text_only": true,
        "trigger": 48
    },
    {
        "id": 48,
        "dialogue": "You ask where the restroom is.",
        "text_only": true,
        "trigger": 49
    },
    {
        "id": 49,
        "dialogue": "You: I will wait. In the meantime, could you direct me to the restroom?",
        "text_only": true,
        "trigger": 50
    },
    {
        "id": 50,
        "dialogue": "She tells you where it is, and you go to start investigating.",
        "text_only": true,
        "trigger": 51
    },
    {
        "id": 51,
        "dialogue": "Front Desk Person: Yes. Just go straight ahead and take a left.  It will be on your right.  I'll let Ambassador Pike know of your visit.",
        "text_only": true,
        "trigger": 52
    },
    {
        "id": 52,
        "dialogue": "Investigate Crime Scene, 4 clues to collect.",
        "teleport_to": [1420, 1430],
        "text_only": false
    },
    {
        "id": 95,
        "dialogue": "Are you sure you're done collecting clues?",
        "trigger_on_done": true,
        "options": [
            {
                "text": "Yes",
                "trigger": 53
            },
            {
                "text": "No",
                "trigger": -1
            }
        ],
        "scene": "embassy",
        "text_only": true
    },
    {
        "id": 53,
        "dialogue": "You rush back to not raise suspiscion about your whereabouts.",
        "text_only": true,
        "trigger": 54,
        "scene": "embassy"
    },
    {
        "id": 54,
        "dialogue": "You introduce yourself to Jeremy, and pretend you're here for witness questioning.",
        "text_only": false,
        "trigger": 56
    },
    {
        "id": 56,
        "dialogue": "You: Hello, Ambassador Pike. I'm Saito, the detective investigating the unfortunate Japanese Ambassador's death. I was just going through the list of the people who attended his party. Could I ask you some questions?",
        "text_only": false,
        "trigger": 57
    },
    {
        "id": 57,
        "dialogue": "Jeremy: Oh. He was a great man. Please send my condolences to his family. I'll try my best to be of help to you.",
        "text_only": false,
        "trigger": 63
    },
    {
        "id": 58,
        "dialogue": "He seems to be smiling and enjoying the Korean foreign minister's company. Is this an indication of collusion?",
        "clue": [197, 95, 41, 100],
        "clue_id": 5,
        "text_only": false
    },
    {
        "id": 59,
        "dialogue": "A bunch of bottles are in a group on the table, and one stands out as the one the Japanese Ambassador was consuming.",
        "clue": [480, 768, 48, 48],
        "clue_id": 6,
        "text_only": false
    },
    {
        "id": 60,
        "dialogue": "Decently secure vault, luckily you're an expert at these sorts of things and can probably open it with ease by looking at it from a different angle, but be careful -- you might get caught.",
        "clue": [96, 150, 70, 90],
        "clue_id": 7,
        "text_only": false
    },
    {
        "id": 61,
        "dialogue": "Luckily, you're an expert of these sorts of things, and you manage to get into the vault, only to find diaries containing very personal information, none of which relating to the case.",
        "clue": [166, 150, 20, 90],
        "clue_id": 8,
        "text_only": false,
        "trigger": 62
    },
    {
        "id": 62,
        "dialogue": "You were spotted breaking into the vault, and you were imprisoned inside the embassy",
        "trigger": 30,
        "text_only": false
    },
    {
        "id": 63,
        "dialogue": "Select a question to ask Jeremy.",
        "options": [
            {
                "text": "What was your relationship with him?",
                "trigger": 65
            },
            {
                "text": "Did you notice anything unusual while at the party?",
                "trigger": 67
            },
            {
                "text": "Did you have dealings with other foreign governments before going to the party?",
                "trigger": 73
            }
        ],
        "text_only": false
    },
    {
        "id": 64,
        "dialogue": "You: What was your relationship with him?",
        "text_only": false,
        "trigger": 68
    },
    {
        "id": 65,
        "dialogue": "Jeremy: Although we had political differences, we still respected each other.",
        "text_only": false,
        "trigger": 66
    },
    {
        "id": 68,
        "dialogue": "Jeremy: Although we had political differences, we still respected each other.",
        "text_only": false,
        "trigger": 70
    },
    {
        "id": 66,
        "dialogue": "You: Did you notice anything unusual while at the party?",
        "text_only": false,
        "trigger": 69
    },
    {
        "id": 67,
        "dialogue": "Jeremy: Nothing out of the ordinary. I was welcomed by the party when I got there, and left promptly when I felt needed.",
        "text_only": false,
        "trigger": 64
    },
    {
        "id": 69,
        "dialogue": "Jeremy: Nothing out of the ordinary. I was welcomed by the party when I got there, and left promptly when I felt needed.",
        "text_only": false,
        "trigger": 70
    },
    {
        "id": 70,
        "dialogue": "You: You seem to be a fan of the sake the ambassador enjoyed. Do you keep more in the vault?",
        "text_only": false,
        "clues_necessary": [6, 7],
        "trigger": 71
    },
    {
        "id": 71,
        "dialogue": "Jeremy: It seems the purpose of your questions was different than the one you stated to Sarah. I'd like to remind you that Japanese investigations do not apply to me as the American Ambassador.",
        "text_only": false,
        "clues_necessary": [6, 7],
        "trigger": 72
    },
    {
        "id": 72,
        "dialogue": "You: I'm sorry. It seems that I've overstepped my bounds.",
        "text_only": false,
        "clues_necessary": [6, 7],
        "trigger": 76
    },
    {
        "id": 73,
        "dialogue": "You are told to leave the embassy.",
        "text_only": false,
        "trigger": 74
    },
    {
        "id": 74,
        "dialogue": "Jeremy: I'm sorry. I don't feel comfortable answering that or any further questions. Please leave the embassy before I need to ask the navy to escort you.",
        "text_only": false,
        "trigger": 75
    },
    {
        "id": 75,
        "dialogue": "Having seen the armed soldiers, you feel that it'd be unwise to stay any longer.",
        "text_only": false,
        "trigger": 30
    },
    {
        "id": 76,
        "dialogue": "You: That's all I need from you, thank you so much for your time. I hope you enjoy your stay in Japan.",
        "text_only": false,
        "trigger": 77
    },
    {
        "id": 77,
        "dialogue": "You leave the embassy.",
        "text_only": true,
        "trigger": 78
    },
    {
        "id": 78,
        "dialogue": "You: While it could be him, it'd be very convenient if it wasn't. I'm not even sure if pursuing him would be worth the effects of a degraded relationship with America.",
        "text_only": true,
        "trigger": 30
    },
    {
        "id": 79,
        "dialogue": "You think of the reasons why Yuki might do something like this.",
        "text_only": true,
        "trigger": 80
    },
    {
        "id": 80,
        "dialogue": "Yuki doesn't seem like the type to do something like this, she's sweet, intelligent and confident.  But, it's hard to ignore the bold letters that say 'Chinese' on her Japanese passport.",
        "text_only": true,
        "trigger": 81
    },
    {
        "id": 81,
        "dialogue": "You decide to investigate further and head to the Inn.",
        "text_only": true,
        "trigger": 82
    },
    {
        "id": 82,
        "dialogue": "You make your way to the Inn, and you are surprised to see a massive building and are even more impressed with Yuki, seeing as she does nearly everything at the Inn, obviously with a few helpers. Maybe she is capable of executing a plan like the murder.",
        "teleport_to": [830, 1340],
        "text_only": false,
        "trigger": 83
    },
    {
        "id": 83,
        "dialogue": "You introduce yourself.",
        "text_only": false,
        "trigger": 84
    },
    {
        "id": 84,
        "dialogue": "You: Hello. I'm Saito, a detective working under the Mr. Aosa. I regrettably have some bad news to deliver if you'll allow me to do so.",
        "text_only": false,
        "trigger": 85
    },
    {
        "id": 85,
        "dialogue": "Yuki: What is the matter?.",
        "text_only": false,
        "trigger": 86
    },
    {
        "id": 86,
        "dialogue": "You: I must say with a heavy hearth that the Ambassador has passed away, and I'm investigating his death as a murder case.",
        "text_only": false,
        "trigger": 87
    },
    {
        "id": 87,
        "dialogue": "Yuki: [expressionlessly] That is regrettable. I'll try my best to assist you. However, because it's gotten to late, I recommend you stay the night. I'll provide for your stay tonight.",
        "text_only": false,
        "trigger": 88
    },
    {
        "id": 88,
        "dialogue": "You: Go to your room and get a little bit of sleep to sober up.",
        "text_only": true,
        "trigger": 89
    },
    {
        "id": 89,
        "dialogue": "You eventually go to your room, and get a few hours of sleep. You wake up, and silently walk around the Inn.  Some of the people you were with last night are drunk and singing loudly. You smile, and you decide to look around.",
        "text_only": true,
        "trigger": 90
    },
    {
        "id": 90,
        "dialogue": "Investigate Crime Scene, 4 clues to collect.",
        "teleport_to": [240, 270],
        "text_only": false
    },
    {
        "id": 91,
        "dialogue": "Even for someone who was the daughter-in-law of a rich property owner, this pottery seemed too expensive to possess.",
        "clue": [720, 623, 48, 52],
        "clue_id": 9,
        "text_only": false
    },
    {
        "id": 92,
        "dialogue": "Revealing Yuki's close connection to her hometown, this telegram was definitely unexpected to find from someone so integrated into the Japanese society.",
        "clue": [822, 337, 50, 90],
        "clue_id": 10,
        "text_only": false
    },
    {
        "id": 93,
        "dialogue": "Even though it only revealed their name ones, it doesn't count out the possibility that these two had stayed the previous weeks too.",
        "clue": [1250, 1250, 47, 47],
        "clue_id": 11,
        "text_only": false
    },
    {
        "id": 94,
        "dialogue": "The document listed very powerful high ranking officials, and even had names of politicians involved in the latest conflict with Manchuria.",
        "clue": [577, 290, 47, 47],
        "clue_id": 12,
        "text_only": false
    },
    {
        "id": 96,
        "dialogue": "Are you sure you're done collecting clues?",
        "trigger_on_done": true,
        "options": [
            {
                "text": "Yes",
                "trigger": 97
            },
            {
                "text": "No",
                "trigger": -1
            }
        ],
        "scene": "inn",
        "text_only": true
    },
    {
        "id": 97,
        "dialogue": "You head back to your room, and you fall asleep. The next morning, you are fresh and ready to ask Yuki questions.",
        "trigger": 98,
        "text_only": true
    },
    {
        "id": 98,
        "teleport_to": [830, 1340],
        "trigger": 99,
        "text_only": false,
        "dialogue": "You see Yuki, and tell her how much you enjoyed last night, and how relaxed and clear-minded you feel."
    },
    {
        "id": 99,
        "trigger": 100,
        "text_only": false,
        "dialogue": "You: Good morning Yuki, I had a great time last night.  I enjoyed the company here, and I would definitely stay again if I need to relax.  With that being said, could I ask you a couple of questions now? "
    },
    {
        "id": 100,
        "trigger": 101,
        "text_only": false,
        "dialogue": "You: How have your relatives been (in China)?"
    },
    {
        "id": 101,
        "trigger": 102,
        "text_only": false,
        "dialogue": "Yuki: I don't maintain as good a connection as I ought to, but they've been well as of the last time I wrote to them."
    },
    {
        "id": 102,
        "trigger": 103,
        "text_only": false,
        "dialogue": "You: How involved were you with the Ambassador's politics?"
    },
    {
        "id": 103,
        "trigger": 104,
        "text_only": false,
        "dialogue": "Yuki: Not very much, but I could tell you about a few select things."
    },
    {
        "id": 104,
        "trigger": 105,
        "clues_necessary": [9, 11, 12],
        "text_only": false,
        "dialogue": "You: Any political power you doubt that played this?"
    },
    {
        "id": 105,
        "trigger": 106,
        "clues_necessary": [9, 11, 12],
        "text_only": false,
        "dialogue": "Yuki: The Americans seem to have grown tensions with the Japanese government it seems from their recent condemnation of Japanese expansion. "
    },
    {
        "id": 106,
        "trigger": 107,
        "text_only": false,
        "dialogue": "You: Did you notice someone unusually close to the Ambassador at the party?"
    },
    {
        "id": 107,
        "trigger": 108,
        "text_only": false,
        "dialogue": "Yuki: Nobody in particular, besides Investigator Rei and Hashida."
    },
    {
        "id": 108,
        "clues_necessary": [9, 11],
        "trigger": 109,
        "text_only": false,
        "dialogue": "You: Any particular guests that seemed involved?"
    },
    {
        "id": 109,
        "clues_necessary": [9, 11],
        "trigger": 110,
        "text_only": false,
        "dialogue": "Yuki: I'm sorry. I can't disclose any information about my guests."
    },
    {
        "id": 110,
        "clues_necessary": [9, 11, 12],
        "trigger": 111,
        "text_only": false,
        "dialogue": "You: You were one of the few early at the party. Do you remember how things progressed in the beginning?"
    },
    {
        "id": 111,
        "clues_necessary": [9, 11, 12],
        "trigger": 112,
        "text_only": false,
        "dialogue": "Yuki: In the beginning it was mostly just the ambassador conversing with Rei and Hashida about political matters. I bothered not to join them."
    },
    {
        "id": 112,
        "trigger": 113,
        "text_only": false,
        "dialogue": "You thank Yuki."
    },
    {
        "id": 113,
        "trigger": 114,
        "text_only": false,
        "dialogue": "You: That's all I need from you, thank you so much for your hospitality, and I know we'll get to the bottom of this."
    },
    {
        "id": 114,
        "trigger": 30,
        "text_only": false,
        "dialogue": "You leave the Inn."
    }
]