[
    {
        "id": 0,
        "dialogue": "Change your selection using the arrow keys. When you're done reading text, press enter. Use the arrow keys to move. Interact with objects by pressing Enter. When you're done collecting clues, press D.",
        "entry": true,
        "text_only": true
    },
    {
        "id": 1,
        "dialogue": "Last night, your squad was invited to the Japanese Foreign Ambassador's party to celebrate his return from Manchuria, but you unfortunately couldn't go due to prior plans with the Navy Lieutenant. Although up early like any other work day, today you were excused from the morning shift because of your plans with the Lieutenant. You prepare for work none the less, and leave in the afternoon after the maid finished packing your lunch.",
        "trigger_event_id": 0,
        "text_only": true
    },
    {
        "id": 2,
        "dialogue": "You get a call from the boss to go to the scene.",
        "trigger_event_id": 1,
        "text_only": true
    },
    {
        "id": 3,
        "dialogue": "An uneventful day at the office, it seemed. However, your partner was missing from his usual post next to your personal office space. Suddenly, you get a call from your squad leader to come to the Foreign Ambassador's home because he was found dead this morning.",
        "trigger_event_id": 2,
        "text_only": true
    },
    {
        "id": 4,
        "dialogue": "You go to the scene; your partner is already there.",
        "trigger_event_id": 3,
        "text_only": false
    },
    {
        "id": 5,
        "dialogue": "",
        "trigger_event_id": 4,
        "character_id": 1,
        "movements": [
            [620, 940]
        ],
        "text_only": false
    },
    {
        "id": 6,
        "dialogue": "Upon arriving there, you're greeted by Rei, your partner.",
        "trigger_event_id": 5,
        "text_only": false
    },
    {
        "id": 7,
        "dialogue": "You talk to your partner and he debriefs you on the general details about the guy and his death.",
        "trigger_event_id": 6,
        "text_only": false
    },
    {
        "id": 8,
        "dialogue": "Rei: Good morning Sades, or maybe not... Not really what we expected when we woke up today, huh? The Ambassador has been found dead by his Mistress this morning.  I can't believe I shook his hand just last night... It looks like he was poisoned at some point, and I'm operating under the assumption that it was for political reasons. Go ahead and take a look around, I'll come up with some initial hypotheses and suspects while you do that.",
        "trigger_event_id": 7,
        "text_only": false
    },
    {
        "id": 9,
        "dialogue": "",
        "trigger_event_id": 8,
        "character_id": 2,
        "movements": [
            [620, 380],
            [840, 380],
            [840, 320],
            [1260, 320],
            [1260, 190],
            [1260, 200]
        ],
        "text_only": false
    },
    {
        "id": 10,
        "dialogue": "As Detective Sades, you will be able to move around and try and collect as many clues per level as you possibly can.   All levels are structured similarly to the Intro level, but be wary, not everything is as it seems.",
        "trigger_event_id": 9,
        "text_only": false
    },
    {
        "id": 11,
        "dialogue": "Investigate Crime Scene, 4 clues to collect.",
        "trigger_event_id": 10,
        "text_only": false
    },
    {
        "id": 12,
        "dialogue": "The Ambassador as you know, was a key figure in the recent victory in Manchuria and continued control of Korea. However, he was also the one responsible for stopping further invasions and had connections to the Chinese governments. Too controlled for his own good, you know he was a target of all the parties he worked with.",
        "trigger_event_id": 13,
        "text_only": false
    },
    {
        "id": 13,
        "dialogue": "Are you sure you're done collecting clues?",
        "trigger_on_done": true,
        "options": [
            "Yes",
            "No"
        ],
        "teleport_to": [1260, 250],
        "text_only": false
    },
    {
        "id": 14,
        "dialogue": "The Ambassador's body looks sickly, but no signs of any real struggle or wounds indicating outside physical harm.  Maybe a poison was used?",
        "clue": [0, 0, 0, 0],
        "text_only": false
    },
    {
        "id": 15,
        "dialogue": "The maid seems crestfallen, and she says that during the party, she overheard some chatter about drinks that seemed unnatural, but she didn't think much of it.",
        "clue": [0, 0, 0, 0],
        "text_only": false
    },
    {
        "id": 16,
        "dialogue": "The lock was broken off and hidden in haste, indicating the sloppy, headstrong nature that the murderer may apply in his/her daily life.",
        "clue": [398, 130, 38, 49],
        "text_only": false
    },
    {
        "id": 17,
        "dialogue": "The assistant was void of emotion, either from shock or another reason.  She was in charge of everything, and you learn more about the guests invited, namely some of the naval officials, as well as some others.",
        "clue": [0, 0, 0, 0],
        "text_only": false
    }
]